{
  "regulationRef": "best-practices-hvac",
  "description": "Boas práticas de engenharia AVAC — comissionamento, equilíbrio hidráulico, segurança, manutenção",
  "extractedBy": "claude-regulatory-expansion-v2",
  "extractedAt": "2026-02-18",
  "rules": [
    {
      "id": "HVAC-CX-01",
      "regulationId": "best-practices-hvac",
      "article": "ASHRAE Guideline 0 / REHVA — Comissionamento (Cx) de Sistemas AVAC",
      "description": "Os sistemas AVAC não foram sujeitos a comissionamento (Cx) após a instalação. O Cx verifica que todos os sistemas funcionam conforme o projeto e assegura a entrega de um edifício funcional ao proprietário.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.hasCommissioning", "operator": "not_exists", "value": null },
        { "field": "hvac.installedHVACPower", "operator": ">=", "value": 25 }
      ],
      "requiredValue": "Comissionamento (Cx) recomendado para sistemas AVAC ≥ 25 kW",
      "remediation": "Realizar comissionamento dos sistemas AVAC conforme ASHRAE Guideline 0 ou similar: verificação funcional de todos os equipamentos (chillers, caldeiras, UTAs, bombas, válvulas), calibração de sondas e controladores, verificação de setpoints, teste de sequências de controlo (arranque, paragem, free-cooling, alarmes), equilíbrio de caudais de ar e água, medição de COP/EER reais, registo fotográfico e relatório final. O Cx é obrigatório em muitos programas de certificação (LEED, BREEAM).",
      "enabled": true,
      "tags": ["comissionamento", "Cx", "ASHRAE", "REHVA", "qualidade"]
    },
    {
      "id": "HVAC-BAL-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas — Equilíbrio Hidráulico",
      "description": "O sistema hidráulico AVAC não possui válvulas de equilíbrio em todos os ramais, resultando em distribuição desigual de caudal e temperaturas desequilibradas entre zonas.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.hasBalancingValves", "operator": "not_exists", "value": null },
        { "field": "hvac.hasPipework", "operator": "exists", "value": null }
      ],
      "requiredValue": "Válvulas de equilíbrio em todos os ramais do sistema hidráulico",
      "remediation": "Instalar válvulas de equilíbrio estáticas ou dinâmicas (PICV — Pressure Independent Control Valves) em todos os ramais do sistema hidráulico. Após instalação, realizar equilíbrio hidráulico: medir e ajustar caudais em cada ramal para corresponder ao caudal de projeto. Utilizar caudalímetro ultrassónico ou medição por perda de carga na válvula. Manter relatório de equilíbrio com caudais medidos vs. projetados.",
      "enabled": true,
      "tags": ["equilíbrio hidráulico", "válvulas", "PICV", "distribuição"]
    },
    {
      "id": "HVAC-COND-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas — Drenagem de Condensados",
      "description": "As unidades de climatização não possuem sistema adequado de drenagem de condensados com sifão, podendo causar fugas de água, danos em materiais e proliferação microbiológica.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.hasCondensateDrain", "operator": "not_exists", "value": null },
        { "field": "hvac.installedCoolingPower", "operator": ">", "value": 0 }
      ],
      "requiredValue": "Drenagem de condensados com sifão em todas as unidades de arrefecimento",
      "remediation": "Instalar sistema de drenagem de condensados em todas as unidades de arrefecimento (UTAs, ventiloconvectores, unidades split): tabuleiro de condensados com inclinação ≥ 1%, tubo de drenagem com sifão (altura = 2× pressão estática da UTA), descarga para rede de esgotos ou ponto de recolha. O tabuleiro deve ser acessível para limpeza. Prever aquecimento do tabuleiro em unidades exteriores para evitar congelação. A estagnação de água nos tabuleiros é uma causa comum de proliferação de Legionella e fungos.",
      "enabled": true,
      "tags": ["condensados", "drenagem", "sifão", "Legionella", "manutenção"]
    },
    {
      "id": "HVAC-VIB-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas — Isolamento Anti-vibrático",
      "description": "Os equipamentos AVAC (compressores, ventiladores, bombas) não possuem apoios anti-vibráticos, transmitindo vibrações e ruído à estrutura do edifício.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.hasVibrationIsolation", "operator": "not_exists", "value": null },
        { "field": "hvac.installedHVACPower", "operator": ">=", "value": 12 }
      ],
      "requiredValue": "Apoios anti-vibráticos em todos os equipamentos AVAC rotativos",
      "remediation": "Instalar apoios anti-vibráticos sob todos os equipamentos rotativos (compressores, ventiladores, bombas): molas de aço para baixa frequência (> 95% isolamento a 50 Hz), borracha para média/alta frequência, bases inerciais de betão para equipamentos de grande porte. Instalar juntas flexíveis (jangadas) nas ligações hidráulicas e de condutas aos equipamentos. Verificar que as tubagens possuem suportes elásticos nos primeiros 10 m após o equipamento. O isolamento anti-vibrático é essencial para cumprir os limites de ruído e vibrações do RRAE (DL 96/2008).",
      "enabled": true,
      "tags": ["vibração", "anti-vibrático", "ruído", "molas", "RRAE"]
    },
    {
      "id": "HVAC-DUCTCLEAN-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas / EN 12097 — Acessos para Limpeza de Condutas",
      "description": "As condutas AVAC não possuem portas de acesso para limpeza e inspeção conforme EN 12097, dificultando a manutenção e comprometendo a qualidade do ar interior.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.hasDuctCleaningAccess", "operator": "not_exists", "value": null },
        { "field": "hvac.hasVentilationSystem", "operator": "exists", "value": null }
      ],
      "requiredValue": "Portas de acesso para limpeza a cada 3 m de conduta e em todos os acessórios",
      "remediation": "Instalar portas de acesso para limpeza conforme EN 12097: a cada 3 m em troços retos, antes e depois de curvas, tês e reduções, nos pontos de medição de caudal, junto a registos e silenciadores. As portas devem ser estanques (juntas de neoprene) e facilmente removíveis sem ferramentas especiais. Em condutas de teto falso, prever alçapões de acesso alinhados com as portas de limpeza. Considerar limpeza profissional das condutas a cada 2-5 anos (NADCA ACR 2013).",
      "enabled": true,
      "tags": ["limpeza", "condutas", "EN 12097", "manutenção", "QAI"]
    },
    {
      "id": "HVAC-EXPANSION-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas — Vaso de Expansão em Circuitos Fechados",
      "description": "O circuito hidráulico fechado do sistema AVAC não possui vaso de expansão, podendo causar sobrepressão e danos nos equipamentos quando a temperatura da água varia.",
      "severity": "critical",
      "conditions": [
        { "field": "hvac.hasExpansionVessel", "operator": "not_exists", "value": null },
        { "field": "hvac.hasPipework", "operator": "exists", "value": null }
      ],
      "requiredValue": "Vaso de expansão obrigatório em todos os circuitos hidráulicos fechados",
      "remediation": "Instalar vaso de expansão de membrana em cada circuito hidráulico fechado. Dimensionar conforme o volume do circuito e a variação de temperatura prevista (ΔV = V × β × ΔT). Pré-carga de azoto = pressão estática do ponto mais alto + 0.3 bar. Instalar manómetro na ligação ao circuito. Verificar a pré-carga anualmente. Para circuitos de grande volume, considerar vasos de expansão com compressor (pressurização automática).",
      "enabled": true,
      "tags": ["vaso de expansão", "pressão", "circuito fechado", "segurança"]
    },
    {
      "id": "HVAC-SAFETY-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas — Válvula de Segurança",
      "description": "O circuito hidráulico pressurizado não possui válvula de segurança (alívio de pressão), representando risco de sobrepressão e avaria do equipamento.",
      "severity": "critical",
      "conditions": [
        { "field": "hvac.hasPressureRelief", "operator": "not_exists", "value": null },
        { "field": "hvac.hasPipework", "operator": "exists", "value": null }
      ],
      "requiredValue": "Válvula de segurança obrigatória em circuitos pressurizados",
      "remediation": "Instalar válvula de segurança (alívio de pressão) em cada circuito pressurizado: calibrada para 10% acima da pressão de trabalho máxima. A descarga deve ser conduzida para ponto seguro (funil com ligação ao esgoto). Nunca instalar válvulas de corte entre a válvula de segurança e o circuito. Testar o funcionamento anualmente (abertura manual + verificação do fecho estanque). Para caldeiras e termoacumuladores, a válvula de segurança é obrigatória por lei.",
      "enabled": true,
      "tags": ["válvula de segurança", "pressão", "segurança", "caldeira"]
    },
    {
      "id": "HVAC-WATER-TREAT-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas — Tratamento de Água do Circuito Fechado",
      "description": "O circuito hidráulico fechado do sistema AVAC não possui tratamento de água, favorecendo corrosão, incrustação e proliferação microbiológica nas tubagens e permutadores.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.hasWaterTreatment", "operator": "not_exists", "value": null },
        { "field": "hvac.hasPipework", "operator": "exists", "value": null }
      ],
      "requiredValue": "Tratamento de água obrigatório em circuitos hidráulicos AVAC",
      "remediation": "Implementar programa de tratamento de água do circuito fechado: inibidor de corrosão (molibdatos ou nitritos), biocida para prevenir proliferação biológica, anticongelante (glicol propilênico 25-35%) se risco de congelação. Encher o circuito com água tratada (baixa condutividade, sem oxigénio dissolvido). Instalar filtro de partículas e desaerificador. Analisar a água anualmente: pH (8.5-10.5), condutividade, teor de inibidor, contagem microbiológica. Manter registo das análises.",
      "enabled": true,
      "tags": ["tratamento de água", "corrosão", "circuito fechado", "manutenção"]
    },
    {
      "id": "HVAC-RETURN-FILT-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas — Filtro no Retorno de Ar",
      "description": "O sistema de ventilação com recuperador de calor não possui filtro no retorno de ar, expondo o recuperador a contaminação e reduzindo a sua eficiência e vida útil.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.hasReturnAirFilter", "operator": "not_exists", "value": null },
        { "field": "hvac.heatRecoveryEfficiency", "operator": ">", "value": 0 }
      ],
      "requiredValue": "Filtro M5 mínimo no retorno de ar para proteção do recuperador",
      "remediation": "Instalar filtro de classe M5 mínima no circuito de retorno de ar, antes do recuperador de calor. O filtro protege o recuperador contra acumulação de poeiras e gorduras que reduzem a eficiência de troca e aumentam a perda de carga. Substituir o filtro conforme periodicidade recomendada pelo fabricante (tipicamente a cada 3-6 meses) ou quando a perda de carga atinge 150-250 Pa. Instalar pressóstato diferencial com alarme para indicação de filtro colmatado.",
      "enabled": true,
      "tags": ["filtro", "retorno", "recuperador", "manutenção"]
    },
    {
      "id": "HVAC-FIRE-SHUTOFF-01",
      "regulationId": "best-practices-hvac",
      "article": "SCIE / Boas Práticas — Corte AVAC em Caso de Incêndio",
      "description": "O sistema AVAC não desliga automaticamente em caso de deteção de incêndio, podendo propagar fumos através das condutas e alimentar o incêndio com ar fresco.",
      "severity": "critical",
      "conditions": [
        { "field": "hvac.hasHVACFireShutoff", "operator": "not_exists", "value": null },
        { "field": "hvac.hasVentilationSystem", "operator": "exists", "value": null }
      ],
      "requiredValue": "Corte automático do AVAC obrigatório em caso de deteção de incêndio",
      "remediation": "Implementar interface entre o sistema de deteção de incêndio (SDI/SADI) e o sistema AVAC: paragem automática de todos os ventiladores de climatização, fecho de todos os registos corta-fogo, fecho dos registos de ar exterior, ativação do sistema de desenfumagem (se existente). A interface deve ser por contactos secos (relé de segurança) com ligação direta à central de deteção de incêndio. Testar a interface semestralmente como parte do plano de manutenção do SCIE.",
      "enabled": true,
      "tags": ["incêndio", "corte AVAC", "SCIE", "segurança", "SDI"]
    },
    {
      "id": "HVAC-INSUL-FIRE-01",
      "regulationId": "best-practices-hvac",
      "article": "EN 13501-1 / SCIE — Reação ao Fogo do Isolamento de Condutas",
      "description": "O isolamento térmico das condutas AVAC possui classe de reação ao fogo inadequada. Em vias de evacuação e espaços públicos, o isolamento deve ser classe A2 ou superior conforme EN 13501-1.",
      "severity": "critical",
      "conditions": [
        { "field": "hvac.insulationFireClass", "operator": "in", "value": ["C", "D"] },
        { "field": "buildingType", "operator": "in", "value": ["commercial", "mixed", "hospital"] }
      ],
      "currentValueTemplate": "Classe {hvac.insulationFireClass}",
      "requiredValue": "Classe A2 ou superior em vias de evacuação e espaços públicos",
      "remediation": "Substituir o isolamento de condutas por material com classe de reação ao fogo adequada: Classe A1 (incombustível): lã de rocha sem revestimento; Classe A2: lã de rocha com revestimento alumínio. Em vias de evacuação, átrios e espaços públicos, o isolamento deve ser classe A2 no mínimo. O isolamento elastomérico (classe B/C) é aceitável em zonas técnicas e tetos falsos não acessíveis ao público. Verificar que o revestimento exterior (chapa, PVC) também cumpre a classe exigida.",
      "enabled": true,
      "tags": ["reação ao fogo", "isolamento", "EN 13501-1", "SCIE", "condutas"]
    },
    {
      "id": "HVAC-NOISE-OFFICE-01",
      "regulationId": "best-practices-hvac",
      "article": "BS 8233 / RRAE — Nível de Ruído em Escritórios",
      "description": "O nível de ruído do sistema AVAC ({hvac.equipmentNoiseRating} NR) excede NR 40 em escritórios de planta aberta, comprometendo o conforto acústico dos ocupantes.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.equipmentNoiseRating", "operator": ">", "value": 40 },
        { "field": "hvac.spaceType", "operator": "==", "value": "office" }
      ],
      "currentValueTemplate": "{hvac.equipmentNoiseRating} NR",
      "requiredValue": "≤ NR 35-40 (escritórios open-plan), ≤ NR 30 (salas de reunião)",
      "remediation": "Reduzir o ruído AVAC: instalar atenuadores acústicos nas condutas (tipo splitter ou cilíndrico), reduzir velocidade do ar nos ramais terminais (≤ 3 m/s), instalar difusores de baixo nível sonoro, revestir o interior das condutas com material absorvente acústico nos primeiros 3 m após o ventilador, verificar o equilíbrio dos ventiladores. Em open-space, o masking sonoro (ruído branco/rosa) pode complementar a redução do ruído AVAC.",
      "enabled": true,
      "tags": ["ruído", "escritório", "NR", "acústica", "conforto"]
    },
    {
      "id": "HVAC-NOISE-HOSPITAL-01",
      "regulationId": "best-practices-hvac",
      "article": "BS 8233 / OMS — Nível de Ruído em Hospitais",
      "description": "O nível de ruído do sistema AVAC ({hvac.equipmentNoiseRating} NR) excede NR 30 em espaço hospitalar, comprometendo o repouso e recuperação dos pacientes.",
      "severity": "critical",
      "conditions": [
        { "field": "hvac.equipmentNoiseRating", "operator": ">", "value": 30 },
        { "field": "hvac.spaceType", "operator": "==", "value": "hospital" }
      ],
      "currentValueTemplate": "{hvac.equipmentNoiseRating} NR",
      "requiredValue": "≤ NR 25-30 (enfermarias), ≤ NR 25 (quartos individuais), ≤ NR 35 (bloco operatório)",
      "remediation": "Implementar medidas de redução de ruído rigorosas para espaços hospitalares: atenuadores acústicos de alto desempenho, difusores perforados de baixíssimo nível sonoro, condutas com revestimento acústico interno, equipamentos em zonas técnicas isoladas acusticamente. Verificar também ruído de válvulas (cavitação), bombas (ressonância), e ventiladores (frequência de pás). Considerar sistemas de teto radiante em vez de ventilação forçada em quartos para minimizar o ruído.",
      "enabled": true,
      "tags": ["ruído", "hospital", "NR", "acústica", "saúde"]
    },
    {
      "id": "HVAC-NOISE-CLASSROOM-01",
      "regulationId": "best-practices-hvac",
      "article": "BS 8233 / BB93 — Nível de Ruído em Salas de Aula",
      "description": "O nível de ruído do sistema AVAC ({hvac.equipmentNoiseRating} NR) excede NR 30 em sala de aula, comprometendo a inteligibilidade da fala e o desempenho académico.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.equipmentNoiseRating", "operator": ">", "value": 30 },
        { "field": "hvac.spaceType", "operator": "==", "value": "classroom" }
      ],
      "currentValueTemplate": "{hvac.equipmentNoiseRating} NR",
      "requiredValue": "≤ NR 30 (salas de aula), ≤ NR 25 (salas de música/exames)",
      "remediation": "Reduzir o ruído AVAC em salas de aula: velocidade de ar nas grelhas ≤ 2 m/s, atenuadores acústicos nas condutas, evitar insuflação direta sobre a zona do professor. Em escolas existentes sem condutas, considerar unidades de ventilação descentralizadas (parede/janela) com ventiladores EC de baixo ruído. O ruído AVAC deve permitir STI (Speech Transmission Index) ≥ 0.60 na posição do aluno mais afastado.",
      "enabled": true,
      "tags": ["ruído", "sala de aula", "NR", "acústica", "educação"]
    },
    {
      "id": "HVAC-MAINT-FILT-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas — Substituição Periódica de Filtros",
      "description": "O plano de manutenção AVAC não inclui substituição periódica de filtros de ar, resultando em filtros colmatados que reduzem o caudal, aumentam o consumo energético e degradam a qualidade do ar interior.",
      "severity": "warning",
      "conditions": [
        { "field": "hvac.hasMaintenancePlan", "operator": "not_exists", "value": null },
        { "field": "hvac.hasVentilationSystem", "operator": "exists", "value": null }
      ],
      "requiredValue": "Substituição de filtros a cada 3-6 meses ou quando ΔP > limite",
      "remediation": "Incluir no plano de manutenção preventiva: substituição de pré-filtros (M5) a cada 3 meses, substituição de filtros finais (F7) a cada 6 meses, verificação mensal da perda de carga dos filtros (pressóstato diferencial). Nunca limpar ou aspirar filtros tipo bolsa ou compacto — sempre substituir. Registar datas de substituição e leituras de pressão diferencial. Custo de energia de um filtro colmatado é 5-10× superior ao custo do filtro novo.",
      "enabled": true,
      "tags": ["filtros", "manutenção", "perda de carga", "QAI"]
    },
    {
      "id": "HVAC-MAINT-PLAN-COMM",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas / RECS — Plano de Manutenção para Edifícios Comerciais < 25 kW",
      "description": "O edifício comercial com potência AVAC < 25 kW não possui plano de manutenção preventiva. Embora não seja obrigatório abaixo de 25 kW, a manutenção preventiva é essencial para a eficiência, qualidade do ar e longevidade dos equipamentos.",
      "severity": "info",
      "conditions": [
        { "field": "hvac.hasMaintenancePlan", "operator": "not_exists", "value": null },
        { "field": "hvac.installedHVACPower", "operator": "<", "value": 25 },
        { "field": "hvac.installedHVACPower", "operator": ">", "value": 0 },
        { "field": "buildingType", "operator": "in", "value": ["commercial", "mixed"] }
      ],
      "requiredValue": "Plano de manutenção preventiva recomendado mesmo para < 25 kW",
      "remediation": "Elaborar plano de manutenção preventiva simplificado: limpeza/substituição de filtros (trimestral), verificação de fugas de refrigerante (anual), limpeza de permutadores e tabuleiros de condensados (semestral), verificação de correias e rolamentos dos ventiladores (semestral), verificação dos termóstatos e controladores (anual). Manter registo de todas as intervenções. A manutenção preventiva prolonga a vida útil dos equipamentos em 30-50% e mantém a eficiência energética.",
      "enabled": true,
      "tags": ["manutenção", "preventiva", "pequena potência", "eficiência"]
    },
    {
      "id": "HVAC-MAINT-COND-CLEAN",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas / NADCA — Limpeza Periódica de Condutas",
      "description": "As condutas AVAC não são sujeitas a limpeza periódica, acumulando poeiras, partículas e potenciais contaminantes microbiológicos que degradam a qualidade do ar interior.",
      "severity": "info",
      "conditions": [
        { "field": "hvac.hasDuctCleaningAccess", "operator": "not_exists", "value": null },
        { "field": "hvac.hasVentilationSystem", "operator": "exists", "value": null }
      ],
      "requiredValue": "Limpeza de condutas a cada 3-5 anos (NADCA ACR 2013)",
      "remediation": "Programar limpeza profissional de condutas AVAC a cada 3-5 anos conforme NADCA ACR 2013 (Assessment, Cleaning & Restoration). A limpeza deve incluir: inspeção vídeo prévia, aspiração com equipamento HEPA, escovagem mecânica, desinfeção (se necessário), inspeção vídeo final. Manter relatório fotográfico antes/depois. Em ambientes hospitalares ou com ocupantes sensíveis, a limpeza deve ser mais frequente (1-2 anos).",
      "enabled": true,
      "tags": ["limpeza", "condutas", "NADCA", "QAI", "manutenção"]
    },
    {
      "id": "HVAC-SERVERROOM-01",
      "regulationId": "best-practices-hvac",
      "article": "ASHRAE TC 9.9 — Climatização de Salas de Servidores",
      "description": "A sala de servidores não dispõe de sistema de climatização dedicado com redundância, comprometendo a continuidade de operação dos equipamentos de TI.",
      "severity": "critical",
      "conditions": [
        { "field": "hvac.spaceType", "operator": "==", "value": "server-room" },
        { "field": "hvac.installedCoolingPower", "operator": "<", "value": 5 }
      ],
      "requiredValue": "Sistema de climatização dedicado com redundância N+1 para salas de servidores",
      "remediation": "Instalar sistema de climatização dedicado para a sala de servidores: unidades de precisão (CRAC/CRAH) com controlo de temperatura ± 1°C e humidade ± 5%. Manter temperatura 18-27°C (ASHRAE A1 classe). Prever redundância N+1 (uma unidade de backup). Instalar sensores de temperatura e humidade com alarme remoto. Garantir alimentação elétrica por UPS. Considerar free-cooling direto ou indireto para poupança energética.",
      "enabled": true,
      "tags": ["sala de servidores", "datacenter", "ASHRAE", "redundância", "climatização"]
    },
    {
      "id": "HVAC-POOL-VENT-01",
      "regulationId": "best-practices-hvac",
      "article": "Boas Práticas / DIN 4108 — Ventilação de Piscinas Cobertas",
      "description": "A piscina coberta não dispõe de sistema de desumidificação e ventilação adequado, resultando em condensação excessiva, degradação dos materiais e ambiente desconfortável.",
      "severity": "critical",
      "conditions": [
        { "field": "hvac.spaceType", "operator": "==", "value": "swimming-pool" },
        { "field": "hvac.hasVentilationSystem", "operator": "not_exists", "value": null }
      ],
      "requiredValue": "Sistema de desumidificação e ventilação dedicado para piscinas cobertas",
      "remediation": "Instalar sistema de ventilação e desumidificação dedicado para a piscina coberta: UTA com desumidificação (bomba de calor de desumidificação ou roda dessecante), temperatura do ar 2-3°C acima da temperatura da água, humidade relativa 50-60% (máximo 65%), pressão negativa no recinto da piscina em relação aos espaços adjacentes. Prever recuperação de calor entre o ar extraído e o ar novo. Utilizar materiais resistentes à corrosão (aço inox 316, alumínio marítimo). Caudal de ar novo: 4-8 renovações por hora.",
      "enabled": true,
      "tags": ["piscina", "desumidificação", "ventilação", "condensação"]
    }
  ]
}
